olliw42/stm32ll-lib/src/stdstm32-uartb.h
static inline void uartb_tx_flush(void)
{
  uartb_txwritepos = uartb_txreadpos = 0;
}
#else
static inline void uartb_tx_flush(void) {}
#endif

#endif // defined UARTB_USE_TX


//-------------------------------------------------------
// RX routines
//-------------------------------------------------------
#ifdef UARTB_USE_RX

static inline uint16_t uartb_rx_available(void)
{
  if (uartb_rxwritepos == uartb_rxreadpos) return 0; // fifo empty
  return 1;
}


uint16_t uartb_rx_bytesavailable(void)
{
int16_t d;

  d = (int16_t)uartb_rxwritepos - (int16_t)uartb_rxreadpos;
  return (d < 0) ? d + (UARTB_RXBUFSIZEMASK + 1) : d;
}


char uartb_getc(void)
{
  while (uartb_rxwritepos == uartb_rxreadpos) {};
  uartb_rxreadpos = (uartb_rxreadpos + 1) & UARTB_RXBUFSIZEMASK;
  return uartb_rxbuf[uartb_rxreadpos];
}


void uartb_getbuf(uint8_t* buf, uint16_t len)
{
uint16_t i;

  for (i = 0; i < len; i++) buf[i] = uartb_getc();
}


static inline char uartb_lookatnextc(void)
{
  return uartb_rxbuf[(uartb_rxreadpos + 1) & UARTB_RXBUFSIZEMASK];
}


static inline void uartb_rx_flush(void)
{
  uartb_rxwritepos = uartb_rxreadpos = 0;
}

#endif // defined UARTB_USE_RX


//-------------------------------------------------------
// INIT routines
//-------------------------------------------------------
// ATTENTION:
// LPUART does not support 0.5 or 1.5 stop bits !!

// helper, usually should not be called itself
void _uartb_initprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
#if !(defined UARTB_IS_LPUART)
LL_USART_InitTypeDef UART_InitStruct = {};

  UART_InitStruct.BaudRate = baud;
  UART_InitStruct.DataWidth = (parity != XUART_PARITY_NO) ? LL_USART_DATAWIDTH_9B : LL_USART_DATAWIDTH_8B;
  UART_InitStruct.StopBits = stopbits;
  UART_InitStruct.Parity = parity;
  UART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  UART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
  UART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
#if defined STM32G4 || defined STM32H5
  UART_InitStruct.PrescalerValue = LL_USART_PRESCALER_DIV1;
#endif

  LL_USART_Init(UARTB_UARTx, &UART_InitStruct);
#else
LL_LPUART_InitTypeDef UART_InitStruct = {};

  UART_InitStruct.BaudRate = baud;
  UART_InitStruct.DataWidth = (parity != LL_USART_PARITY_NONE) ? LL_LPUART_DATAWIDTH_9B : LL_LPUART_DATAWIDTH_8B;
  UART_InitStruct.StopBits = stopbits;
  UART_InitStruct.Parity = parity;
  UART_InitStruct.TransferDirection = LL_LPUART_DIRECTION_TX_RX;
  UART_InitStruct.HardwareFlowControl = LL_LPUART_HWCONTROL_NONE;
  UART_InitStruct.PrescalerValue = LL_LPUART_PRESCALER_DIV1;

  LL_LPUART_Init(UARTB_UARTx, &UART_InitStruct);
#endif
}


void uartb_setprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
#if !(defined UARTB_IS_LPUART)
  LL_USART_Disable(UARTB_UARTx); // must be disabled to configure some registers
  _uartb_initprotocol(baud, parity, stopbits);
  LL_USART_Enable(UARTB_UARTx);
#else
  LL_LPUART_Disable(UARTB_UARTx); // must be disabled to configure some registers
  _uartb_initprotocol(baud, parity, stopbits);
  LL_LPUART_Enable(UARTB_UARTx);
#endif
}


void uartb_setbaudrate(uint32_t baud)
{
  uartb_setprotocol(baud, XUART_PARITY_NO, UART_STOPBIT_1);
}


void uartb_tx_enablepin(FunctionalState flag)
{
#ifdef UARTB_USE_TX
  if (flag == ENABLE) {
    gpio_change_af(UARTB_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTB_IO_AF, IO_SPEED_VERYFAST);
  } else {
    gpio_change(UARTB_TX_IO, IO_MODE_INPUT_ANALOG, IO_SPEED_VERYFAST);
  }
#endif
}


void uartb_rx_enableisr(FunctionalState flag)
{
#ifdef UARTB_USE_RX
  if (flag == ENABLE) {
    // Enable Receive Data register not empty interrupt
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTB_UARTx);
#endif
    LL_USART_ReceiveData8(UARTB_UARTx); // read DR to clear RXNE and error flags
    LL_USART_EnableIT_RXNE(UARTB_UARTx);
  } else {
    LL_USART_DisableIT_RXNE(UARTB_UARTx);
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTB_UARTx);
#endif
  }
#endif
}


void uartb_init_isroff(void)
{
  LL_USART_Disable(UARTB_UARTx);

  // Initialize clocks for USART/LPUART, GPIO, AFIO
  rcc_init_afio();
  rcc_init_uart(UARTB_UARTx);
#ifdef STM32F1
#if defined UARTB_USE_UART1_PB6PB7
  LL_GPIO_AF_EnableRemap_USART1();
#endif
#if defined UARTB_USE_UART2_PD5PD6
  LL_GPIO_AF_EnableRemap_USART2();
#endif
#if defined UARTB_USE_UART3_PC10PC11
  LL_GPIO_AF_RemapPartial_USART3();
#endif
#endif // STM32F1

  // Configure pin USART/LPUART Tx as alternative function push-pull
#ifdef UARTB_USE_TX
  gpio_init_af(UARTB_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTB_IO_AF, IO_SPEED_VERYFAST);
#endif

  // Configure pin USART/LPUART Rx as input with pull up
#ifdef UARTB_USE_RX
#ifndef UARTB_INVERTED
  gpio_init_af(UARTB_RX_IO, IO_MODE_INPUT_PU, UARTB_IO_AF, IO_SPEED_VERYFAST);
#else
  gpio_init_af(UARTB_RX_IO, IO_MODE_INPUT_PD, UARTB_IO_AF, IO_SPEED_VERYFAST);
#endif
#endif

  // Configure USART/LPUART
  _uartb_initprotocol(UARTB_BAUD, XUART_PARITY_NO, UART_STOPBIT_1);
#if !(defined UARTB_IS_LPUART)
  LL_USART_ConfigAsyncMode(UARTB_UARTx);
#if defined STM32G4 || defined STM32H5
  LL_USART_DisableFIFO(UARTB_UARTx);
  LL_USART_SetTXFIFOThreshold(UARTB_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
  LL_USART_SetRXFIFOThreshold(UARTB_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
#endif
#else
  LL_LPUART_DisableFIFO(UARTB_UARTx);
  LL_LPUART_SetTXFIFOThreshold(UARTB_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
  LL_LPUART_SetRXFIFOThreshold(UARTB_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
#endif

#ifdef UARTB_INVERTED
#ifdef UARTB_USE_TX
  LL_USART_SetTXPinLevel(UARTB_UARTx, LL_USART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef UARTB_USE_RX
  LL_USART_SetRXPinLevel(UARTB_UARTx, LL_USART_RXPIN_LEVEL_INVERTED);
#endif
#endif

  // Configure NVIC channel
#if defined UARTB_USE_RX || defined UARTB_USE_TX_ISR
#ifdef UARTB_PREEMPTIONPRIORITY
  #error Legacy UARTB_PREEMPTIONPRIORITY used !
#endif
#ifdef UARTB_SUBPRIORITY
  #error Legacy UARTB_SUBPRIORITY used !
#endif
#ifdef UARTB_PRIORITY
#error Legacy UARTB_PRIORITY used !
#endif
#ifndef UARTB_IRQ_PRIORITY
  #define UARTB_IRQ_PRIORITY  15 // set priority to lowest
#endif
  nvic_irq_enable_w_priority(UARTB_IRQn, UARTB_IRQ_PRIORITY);
#endif

#ifdef UARTB_USE_TX_ISR
  // Disable Transmit Data Register empty interrupt
  LL_USART_DisableIT_TXE(UARTB_UARTx);
  LL_USART_DisableIT_TC(UARTB_UARTx);
  LL_USART_ClearFlag_TC(UARTB_UARTx);
  // Flush buffer
  uartb_txwritepos = uartb_txreadpos = 0;
#endif

